**Terraform Plan Output**
```terraform
[0m[1mgoogle_bigquery_dataset.taxi_dataset: Refreshing state... [id=projects/tenacious-torus-447715-b4/datasets/Chicagos][0m
[0m[1mgoogle_bigquery_table.taxi_trips_table: Refreshing state... [id=projects/tenacious-torus-447715-b4/datasets/Chicagos/tables/taxissss][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # google_bigquery_dataset.taxi_dataset[0m has been deleted
[0m  [31m-[0m[0m resource "google_bigquery_dataset" "taxi_dataset" {
      [31m-[0m[0m dataset_id                      = "Chicagos" [90m-> null[0m[0m
        id                              = "projects/tenacious-torus-447715-b4/datasets/Chicagos"
        [90m# (19 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_bigquery_dataset.taxi_dataset[0m will be created
[0m  [32m+[0m[0m resource "google_bigquery_dataset" "taxi_dataset" {
      [32m+[0m[0m creation_time              = (known after apply)
      [32m+[0m[0m dataset_id                 = "Chicagos"
      [32m+[0m[0m default_collation          = (known after apply)
      [32m+[0m[0m delete_contents_on_destroy = false
      [32m+[0m[0m effective_labels           = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m etag                       = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m is_case_insensitive        = (known after apply)
      [32m+[0m[0m last_modified_time         = (known after apply)
      [32m+[0m[0m location                   = "US"
      [32m+[0m[0m max_time_travel_hours      = (known after apply)
      [32m+[0m[0m project                    = "tenacious-torus-447715-b4"
      [32m+[0m[0m self_link                  = (known after apply)
      [32m+[0m[0m storage_billing_model      = (known after apply)
      [32m+[0m[0m terraform_labels           = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }

      [32m+[0m[0m access (known after apply)
    }

[1m  # google_bigquery_table.taxi_trips_table[0m will be created
[0m  [32m+[0m[0m resource "google_bigquery_table" "taxi_trips_table" {
      [32m+[0m[0m creation_time       = (known after apply)
      [32m+[0m[0m dataset_id          = "Chicagos"
      [32m+[0m[0m deletion_protection = true
      [32m+[0m[0m effective_labels    = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m etag                = (known after apply)
      [32m+[0m[0m expiration_time     = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m last_modified_time  = (known after apply)
      [32m+[0m[0m location            = (known after apply)
      [32m+[0m[0m num_bytes           = (known after apply)
      [32m+[0m[0m num_long_term_bytes = (known after apply)
      [32m+[0m[0m num_rows            = (known after apply)
      [32m+[0m[0m project             = "tenacious-torus-447715-b4"
      [32m+[0m[0m schema              = (known after apply)
      [32m+[0m[0m self_link           = (known after apply)
      [32m+[0m[0m table_id            = "taxissss"
      [32m+[0m[0m terraform_labels    = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m type                = (known after apply)

      [32m+[0m[0m view {
          [32m+[0m[0m query          = <<-EOT
                SELECT *
                      FROM `bigquery-public-data.chicago_taxi_trips.taxi_trips`
                      WHERE trip_start_timestamp BETWEEN '2023-06-01' AND '2023-12-31'
            EOT
          [32m+[0m[0m use_legacy_sql = false
        }
    }

[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
<!-- Sticky Pull Request Comment -->